{
  "teamMembers": [
    {
      "name": "Michael Marcell",
      "role": "President",
      "image": "../../images/team-marcell-mike.jpg",
      "email": "mmarcell@k2consulting.com",
      "phone": "240.507.4755",
      "details": [
        "Mike Marcell is President of K2's Integrated Solutions Group and Government Operating Solutions divisions. He has 20 years of experience in project management and controls, program scheduling, risk management, and Building Information Modeling (BIM) solutions, and has led projects for a wide range of clients that include government agencies, Lockheed Martin, General Electric, General Dynamics, and Westinghouse.",
        "Previously, Marcell was a Program Manager and Project Controls Manager with General Dynamics Robotic Systems, where he implemented the corporate earned value management system, developed operating procedures, and standardized critical path methodologies (CPM).",
        "Before joining General Dynamics, Marcell was a Project Controls Manager at K2 and oversaw the scheduling and planning of a $2 billion Federal Aviation Administration (FAA) program.",
        "Marcell is an expert in CPM scheduling, software integration, enterprise portfolio management, risk mitigation, Program Management Information Systems (PMIS), and Earned Value Management Systems (EVMS).",
        "Marcell is a board member of the National Capital Chapter of the Association for the Advancement of Cost Engineering (AACEi), a certified Planning and Schedule Professional (PSP), and Earned Value Professional (EVP). He is also a board member and instructor at the College of Performance Management and a Scheduling Professional at the Program Management Institute.",
        "He received a Bachelor of Science (BS) degree and Master of Business Administration (MBA) degree from the University of Maryland."
      ]
    },
    {
      "name": "Nishadi Perera",
      "role": "Vice President",
      "image": "../../images/team-perera-nishadi.png",
      "email": "nperera@k2consulting.com",
      "phone": "240.930.0312",
      "details": [
        "Nishadi Perera is the Vice President of the Integrated Solutions Group at K2, where she oversees operations spanning project controls, technology solutions, and cybersecurity. She leads strategic initiatives that optimize operational performance and ensure the delivery of high-quality, client-focused solutions aligned with K2’s mission and values.",
        "With over 20 years of industry experience, Nishadi is a certified project management consultant with deep expertise in program planning and scheduling for large-scale, complex initiatives. Her background includes cross-functional project delivery and operational execution, supporting projects valued at up to $15 billion. She has worked with a diverse range of public and private sector clients, including transit authorities, airports, and major multi-phase developments.",
        "Nishadi began her career at Clark Construction Group, where she gained valuable experience in the field, contributing to high-profile projects in Washington, D.C., and Baltimore. She also supported numerous projects across the Mid-Atlantic region as a member of the Scheduling department, deepening her technical expertise and developing strategic management skills.",
        "Nishadi holds a Bachelor of Civil Engineering and a Master of Science in Engineering Management from The Catholic University of America. She is credentialed by the Association for the Advancement of Cost Engineering International (AACE) as both a Planning and Scheduling Professional (PSP) and an Earned Value Professional (EVP). She also holds certifications from the Project Management Institute (PMI) as a Project Management Professional (PMP) and a Scheduling Professional (PMI-SP). Nishadi is OSHA-trained and certified as a Safety Trained Supervisor in Construction (STSC), and a LEED Accredited Professional in Building Design + Construction (LEED AP BD+C), recognized by the U.S. Green Building Council."
      ]
    },
    {
      "name": "Paul Krogh",
      "role": "Chairman, Subject Matter Expert",
      "image": "../../images/team-krogh-paul.jpg",
      "email": "pkrogh@k2consulting.com",
      "details": [
        "Paul Krogh is the founder and Chairman of K2 Construction Consultants, Inc, and the subject matter expert of K2's Integrated Solutions Group division. For more than 35 years, Krogh has provided project consulting services on large capital programs in the United States and around the world. He is widely recognized for his expertise in planning, scheduling, cost and risk management, and claims avoidance and resolution.",
        "At CEO, Krogh is responsible for the execution of long-range goals, strategic planning, and the creation and implementation of corporate policies. Under his leadership, the company has grown from two to sixty employees.",
        "Krogh has played a prominent role on major airport, hotel, utility, industrial, and transportation infrastructure projects for commercial, government, and institutional clients. He regularly serves as an expert witness in court and he has been involved in the successful resolution of hundreds of claims disputes.",
        "Krogh is a graduate of the University of North Carolina at Chapel Hill and earned a Master of Business Administration (MBA) degree from George Washington University. He is certified as a Project Management Professional (PMP) by the Project Management Institute (PMI) and as a Certified Forensic Claims Consultant (CFCC) and Certified Cost Professional (CCP) by the Association for the Advancement of Cost Engineering International (AACEi)."
      ]
    },
    {
      "name": "Nathan Hohenstreet",
      "role": "Director of Project Controls",
      "image": "../../images/team-hohenstreet-nathan.jpg",
      "email": "nhohenstreet@k2consulting.com",
      "phone": "240.904.0480",
      "details": [
        "Nathan Hohenstreet is the Director of Project Controls for the K2 Integrated Solutions Group. He has more than 20 years' experience in Project Management, and is an expert in schedule and cost control, data analysis, process and Earned Value Management Systems (EVMS), Key Performance Indicator (KPI) reporting, software integration, impact analysis, and operational efficiency.",
        "Previously, Hohenstreet was Project Controls Manager at Envirocon, where he created and implemented Standard Operating Procedures (SOP) for schedules, workflow monitoring, budget development, financial forecasting, and cash flow analysis.",
        "Most recently, Hohenstreet was Senior Consultant on a project at the Y-12 National Security Complex, a Nuclear Security Administration facility in Tennessee, where he developed a program schedule and project controls that met strict system requirements.",
        "He also has provided schedule analysis for the Department of Energy on its Waste Isolation Pilot Project and its Idaho National Laboratory program.",
        "Hohenstreet received his Bachelor of Science degree from the University of Idaho, with a concentration in Production and Operations Management. He also has Engineering and Business degrees and is OSHA-certified."
      ]
    },
    {
      "name": "Michael Danish",
      "role": "Director of Data Transformation",
      "image": "../../images/team-danish-michael.jpg",
      "email": "mdanish@k2consulting.com",
      "phone": "305.699.9932",
      "details": [
        "Michael Danish is the Director of Data Transformation for the K2 Integrated Solutions Group, bringing over 18 years of experience in project management and project controls across diverse global environments. In his role, Michael is responsible for managing and expanding Project Management Information Systems (PMIS) implementation and support services, Data Analytics & Visualization, Artificial Intelligence (AI) and Machine Learning (ML), Virtual Design Construction (VDC) including BIM (3D), schedule integration (4D), and cost integration (5D) capabilities to support clients with the development and improvement of their project performance and project controls capabilities.",
        "Michael has extensive experience in project controls, strategic planning, and risk management across a wide range of industries including defense, oil and gas, nuclear, renewable energy, building construction, and transportation. He specializes in building and implementing robust project controls systems, developing standardized processes and workflows, and delivering successful outcomes throughout the entire project lifecycle for both government and commercial clients.",
        "His international experience is extensive, having worked on challenging projects in Afghanistan, Iraq, Guam, Japan, Taiwan, and the United Arab Emirates. Before joining K2, he was a Senior Project Controls Manager at EnergySolutions where he was responsible for providing project controls and strategic planning services for nuclear decommissioning projects, including for the Fukushima Daiichi project.",
        "Michael is a Certified Cost Professional (CCP), Planning and Scheduling Professional (PSP), Earned Value Professional (EVP), Project Management Professional (PMP), Certified Scrum Master (CSM), Cobra Certified Professional, and Certified Primavera P6 Enterprise Implementation Specialist. He earned Bachelor of Science degrees in Finance and Economics from West Virginia University and an Executive Master of Business Administration from Columbia University."
      ]
    },
    {
      "name": "Joseph Hellenbrand",
      "role": "Director of Claims Resolution",
      "image": "../../images/team-hellenbrand-joseph.jpg",
      "email": "jhellenbrand@k2consulting.com",
      "phone": "215.380.9174",
      "details": [
        "Joseph Hellenbrand is the Director of Claims Resolution for the K2 Integrated Solutions Group. In his role, Joe leads our practice dedicated to claims advisory services, preparation, and dispute resolution.",
        "Joe brings over 30 years of experience in construction and project management, planning, engineering, and claims analysis across a wide variety of projects supporting both private and public sector customers. He is an expert in Critical Path Method (CPM) scheduling, project controls, project management, logistics, and impact cost damage assessment. Additionally, he has conducted productivity and claim evaluations for large-scale government and commercial projects.",
        "Joe earned his Bachelor’s Degree in Civil Engineering from Catholic University and is a Professional Engineer licensed in the Commonwealth of Pennsylvania. He is a Certified Planning and Scheduling Professional from AACE, the author of multiple publications, and a sought-after speaker in construction claims management and resolution."
      ]
    },
    {
      "name": "Lloyd Hooper",
      "role": "Director of Cybersecurity",
      "image": "../../images/team-hooper-lloyd.jpg",
      "email": "lhooper@k2consulting.com",
      "phone": "301.385.5734",
      "details": [
        "Lloyd Hooper is the Director of Cybersecurity for the K2 Integrated Solutions Group. With over two decades of expertise in cybersecurity modernization solutions, Lloyd specializes in aligning security architecture, engineering, and design with emerging cybersecurity and cloud technology standards. He delivers results-oriented, agile security services that enhance risk management programs while automating processes and integrating the best practices of NIST Risk Management and Cybersecurity Frameworks.",
        "Lloyd brings extensive federal experience, having served as Senior Information Systems Security Manager for multiple government agencies including USCIS, DHS, and TSA. His expertise encompasses Authority to Operate (ATO) processes, System Security Plan development, Privacy Impact Assessments, continuous monitoring, and Security Controls Assessments. He has successfully managed complex cybersecurity programs, including FedRAMP authorization for SaaS solutions in AWS GovCloud and comprehensive RMF implementations across federal information systems.",
        "A highly credentialed cybersecurity professional, Lloyd holds multiple prestigious certifications including Certified Information Security Manager (CISM), Certified Information Systems Auditor (CISA), Project Management Professional (PMP), CompTIA Security+, AWS Certified Solution Architect, and Certified Scrum Master (CSM). His expertise spans vulnerability management, incident response, governance risk and compliance (GRC), and secure DevSecOps processes.",
        "Lloyd excels in managing cross-functional teams within Waterfall, Agile, and DevSecOps environments, demonstrating exceptional ability to drive operational excellence while ensuring compliance with federal standards including FISMA, NIST SP 800-53, and DHS security policies. He is committed to mentoring teams to develop innovative solutions and enhance their technical expertise while streamlining workflows to improve organizational resilience against evolving security threats.",
        "Lloyd earned his Bachelor of Science in Business Administration (Magna cum Laude) from Strayer University and a Bachelor of Arts from Maithili Vishwavidyapith University. He also holds advanced certificates in Program Management from George Mason University and is certified in Six Sigma Yellow Belt, PRINCE2 Agile, and Section 508 Trusted Tester methodologies."
      ]
    },
    {
      "name": "Tim Boatwright",
      "role": "Director of Earned Value Management Systems",
      "image": "../../images/team-boatwright-tim.jpg",
      "email": "tboatwright@k2consulting.com",
      "phone": "240.517.0416",
      "details": [
        "Tim Boatwright is the Director of Earned Value Management Systems, a focus area in our Integrated Program Solutions division. Tim is responsible for K2’s EVMS services which help clients meet contractual compliance obligations, elevate project performance, and conduct sophisticated organizational analysis. His team focuses on EVMS policy and procedure development, cost and schedule integration, sustainment, training, and the deployment of the Integrated Program/Project Management Maturity and Environment Total Risk Rating (IP2M METRR) capabilities that are changing how organizations assess Project Management maturity.  The EVMS team has trained experts in the facilitation of IP2M METRR, guiding project teams to meaningful insights and road maps for improvement.",
        "Tim has over thirty years of program and project management experience, focusing on delivering results for large capital acquisition projects. He has designed, implemented, and audited EVM Systems in various industries and led teams applying those skills.",
        "Tim has provided strategic consulting, training, and program assessment services for clients where he has facilitated over 30 Integrated Baseline Reviews (IBR), served as a Subject Matter Expert for the General Accountability Office (GAO), and developed policy documents for the Federal Aviation Agency (FAA). He was the lead EVM SME for the DHS market for Booz Allen, where he managed a scheduling and EVM SMEs team.",
        "Tim co-founded Acumen PM, the developer of Acumen Fuse, that became one of the industry’s leading schedule analytics tools. He has held the chair for the Earned Value Professional certification offered by the Association for the Advancement of Cost Engineering in the early stages of the certification’s development.  He is currently on the Board of Directors for the College of Performance Management."
      ]
    }
  ]
}
